#include <Arduino.h>



#define LED_OUT 15
const int ledChannel = 0; // Визначаємо канал ШІМ, який будемо використовувати для керування світлодіодом

void setup() {
  Serial.begin(115200); // Ініціалізуємо серійний порт для виводу повідомлень у монітор порту
  // 1. Налаштовуємо канал ШІМ: (номер_каналу, частота, розрядність)
  ledcSetup(ledChannel, 5000, 8); // 8 біт → значення 0…255 (256 рівнів)

  // 2. Прив'язуємо фізичний пін до цього каналу: (номер_піна, номер_каналу)
  ledcAttachPin(LED_OUT, ledChannel);
  ledcWrite(ledChannel, 128); // 64 / 256 = 25 % часу HIGH → світлодіод світить слабше
}

void loop() {
}
